#
# Copyright (C) 2021-2022 by TeamYukki@Github, < https://github.com/TeamYukki >.
#
# This file is part of < https://github.com/TeamYukki/YukkiMusicBot > project,
# and is released under the "GNU v3.0 License Agreement".
# Please see < https://github.com/TeamYukki/YukkiMusicBot/blob/master/LICENSE >
#
# All rights reserved.

HELP_1 = """✅**<u>اوامر الادمن:</u>**

⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗
🎧 | - إليك اوامر التحكم بالمقاطع المشغله ( دآخل المجموعات )  •
🔻 | - الاوامر تعمل بدون استخدام اي علامات  •
⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗

◍ -『 **وقف** 』\n لإيقاف المقطع مؤقتآ داخل المحادثه الصوتيه  •
◍ -『 **كمل** 』\n لاستئناف المقطع مره اخري داخل المحادثه الصوتيه  •
◍ -『 **اسكت** 』\n لكتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 **اتكلم** 』\n لألغاء كتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 **تخطي** 』\n للتخطي إلي المقطع المنتظر بقائمة الانتظار لديك  •
◍ -『 **ايقاف** 』\n لأنهاء التشغيل ومغادره المساعد المحادثه الصوتيه  •
⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗
🎙️ | - إليك اوامر التحكم بالمقاطع المشغله ( دآخل القنوات )  •
🔻 | - الاوامر تعمل بدون استخدام اي علامات  •
⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗

◍ -『 **وقف** 』\n لإيقاف المقطع مؤقتآ داخل المحادثه الصوتيه  •
◍ -『 **كمل** 』\n لاستئناف المقطع مره اخري داخل المحادثه الصوتيه  •
◍ -『 **اسكت** 』\n لكتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 **اتكلم** 』\n لألغاء كتم صوت المقطع داخل المحادثه الصوتيه  •
◍ -『 **تخطي** 』\n للتخطي إلي المقطع المنتظر بقائمة الانتظار لديك  •
◍ -『 **ايقاف** 』\n لأنهاء التشغيل ومغادره المساعد المحادثه الصوتيه  •
⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗."""


HELP_2 = """✅<u>**اوامرالتشغيل :**</u>

🎺 | - اوامر تشغيل البوت في الجروبات والقنوات  •
🎺 | - الاوامر تعمل بدون استخدام اي علامات  •
⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗
◍ - اوامر تشغيل البوت في المجموعات - √

◍ -『 **تشغيل** 』\n ثم اسم المقطع الصوتي او الرابط الخاص به  •
◍ -『 **فيديو** 』\n ثم اسم مقطع الفيديو او الرابط الخاص به  •
◍ -『 **تنزيل** 』\n ثم اسم المقطع المراد تنزيله من موقع اليوتيوب مباشر او الرابط الخاص به  •
◍ -『 **ريلود** 』\n قم بأرسالها ( دآخل المجموعات ) لتحديث قائمه المشرفين بمجموعتك  •
⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗
◍ - **جزء القنوات** - √
◍ - اوامر تشغيل البوت في القنوات 👇 - √

◍ -『 **تشغيل** 』\n ثم اسم المقطع الصوتي او الرابط الخاص به لتشغيله بقناتك  •
◍ -『 **فيديو** 』\nثم اسم الفيديو او الرابط الخاص به لتشغيله بقناتك  •
⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗."""


HELP_3 = """✅<u>**اوامر البوت:**</u>

⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗
✅ | - إليك قسم ( الاوامر الاضافيه ) للبوت  •
✅ | - جميع الاوامر تعمل بدون علامات  •
⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗

◍ -『 **حدد** 』\n ثم رقم المجموعات الذي تستخدم بوتك فيديو بنفس الوقت •

◍ -『 **وضع شغل** 』\n لضبط وضع تحكم التشغيل للأدمن او للاعضاء داخل مجموعتك  •

◍ -『 **القائمه** 』\n لعرض قائمه التشغيل الخاصه بك  •

◍ -『 **حذف القائمه** 』\n لحذف قائمه التشغيل الخاصه بك  •

◍ -『 **لغه** 』\n لتغيير لغة البوت إلي اي لغه اخري  •

◍ -『 **احصائيات** 』\n لعرض قسم الاحصائيات العامه للبوت ولترند التشغيل العالمي •

◍ -『 **ريلود** 』\n لتحديث قائمة المشرفين داخل مجموعتك •

◍ -『 **بينج** 』\n لقياس سرعه التشغيل علي السيرفر وعرض تفاصيل معلومات التشغيل •

◍ -『 **كلمات** 』\n ثم اسم الاغنيه لجلب كلمات الاغنيه كامله بصيغه النصوص •

◍ -『 **تنزيل** 』\n ثم اسم المقطع او الرابط الخاص به لتحميله مباشر من اليوتيوب •
⋖≔𖣥≕✯᥉ُِᥱُِᤁُِᥲَِᖇ✯≔𖣥≕⋗"""

HELP_4 = """⋖≔𖣥≕✯𝐒 𝐄 𝐙 𝐀 𝐑✯≔𖣥≕⋗

★قايمه مميزات سورس سيزر

⚡↰ قول↳✧
🌧️↰ بايو  ↳✧
⚡☔↰ سورس ↳✧
🌖↰ احكام ↳✧
🌗↰ نكته ↳✧
🐺↰ الذكاء الاصطناعي ↳✧
🌠↰ ايدي ↳✧
🪐↰ صوره ↳✧
🌄↰ انمي ↳✧
🦓↰ متحركه ↳✧
🦕↰ سوره ↳✧
🦢↰ الشيخ ↳✧
🦠↰ استوري ↳✧
🍒↰ الرابط ↳✧
🥭↰ سيزر ↳✧
🧊↰ غنيلي ↳✧
🍯↰ افتار عيال  ↳✧
🥮↰ افتارات مكس ↳✧
🍪↰ اقتباسات ↳✧
🍧↰ هيدرات ↳✧
🥧↰ نداء ↳✧
🚲↰ زوجني ↳✧
🎪↰ ابراج ↳✧
🏭↰ احرف ↳✧
🔓↰ اذكار ↳✧
📐↰ كت ↳✧
⚱️↰ خيروك ↳✧
🗃️↰ صراحه ↳✧
🪝↰ زخرفه ↳✧
🦺↰ مين في الكول ↳✧
👕↰ المالك ↳✧
🧣↰ المصنع ↳✧
🪡↰ الالعاب ↳✧
🎰↰ معلوماته ↳✧
🎛️↰ افتارات بنات ↳✧
🧵↰ افتارات عيال ↳✧

⋖≔𖣥≕✯𝐒 𝐄 𝐙 𝐀 𝐑✯≔𖣥≕⋗."""

HELP_5 = """اوامر مالكين البوت : 

• | رفع ثانوي لرفع الشخص مطور ثانوي .🕷

• | رفع ادمن لرفع الشخص ادمن .🕷

• | تنزيل ثانوي الشخص من المطورين الثانويين .🕷

• | تنزيل ادمن الشخص من الادمنيه .🕷

• | الادمنيه لعرض ادمنيه البوت .🕷

• | الثانويين لعرض المطورين الثانويين .🕷

• | اذاعه لعمل اذاعه ف البوت .🕷"""

HELP_6 = """⚡اوامر البنك

👮‍♂️ « المطور » ⇊
════════ ××× ════════ٴ
➕╖ اضف فلوس + المبلغ «» ❬ بالرد علي الشخص المراد اضافه الفلوس له ❭
🗑╢ حذف حسابه «» ❬ بالرد علي الشخص المراد حذف حسابه ❭
❌╢ حذف حساب + اليوزر «» ❬ لحذف حساب الشخص ❭
😵╜ تصفير البنك «» ❬ لمسح كل الحسابات ❭

👨‍🦳 « الاعضاء » ⇊
════════ ××× ════════ٴ
📑╖ انشاء «» فتح حساب بنكي
🤑╢ فلوسي «» اموالي
💸╢ فلوسه «» امواله ❬ بالرد علي الشخص ❭
🏦╢ بنكي «» حسابي
💰╢ بنكه «» حسابه ❬ بالرد علي الشخص ❭
♻️╢ تحويل + المبلغ
☠️╢ كنز
🤖╢ استثمار + المبلغ
🍃╢ حظ + المبلغ
⏫╢ مضاعفه «» مضاربه + المبلغ
🎯╢ عجله الحظ
🤞╢ رشوه
🥺╢ بقشيش
⏳╢ راتب
📎╢ سرقه «» اسرق ❬ بالرد علي الشخص ❭
🚔╢ شرطه «» شرطة ❬ بالرد علي الشخص ❭
⭐️╢ حمايه اموالي «» ❬ لحمايه اموالك من السرقه ❭
👮╢ شرطه + اليوزر
💂‍♀️╢ توب الحراميه «» توب السرقه
⤴️╜ توب الفلوس «» توب فلوس
════════ ××× ════════ٴ

"""